{"config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "name": "conv2d_1", "bias_regularizer": null, "batch_input_shape": [null, 1, 60, 60], "trainable": true, "strides": [1, 1], "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "dilation_rate": [1, 1], "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "trainable": true}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}